openocd-org/openocd/src/flash/nor/mpc56xx.c
/***************************************************************************
 *   Copyright (C) 2005 by Dominic Rath                                    *
 *   Dominic.Rath@gmx.de                                                   *
 *                                                                         *
 *   Copyright (C) 2008 by Spencer Oliver                                  *
 *   spen@spen-soft.co.uk                                                  *
 *                                                                         *
 *   Copyright (C) 2008 by John McCarthy                                   *
 *   jgmcc@magma.ca                                                        *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program.  If not, see <http://www.gnu.org/licenses/>. *
 ***************************************************************************/

/* MPC version (C) 2015 James Murray */

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include <jtag/jtag.h>
#include "imp.h"
#include <target/algorithm.h>
#include <target/mpc56xx_jtag.h>
#include <target/mpc56xx.h>

#define MPC56XX_MANUF_ID	0x029 /* will be wrong */

struct mpc56xx_flash_bank { /* all unknown at the moment */
	uint32_t *block_bits_lmlr;
	uint32_t *block_bits_hlr;
	uint32_t disable_bit;
	uint32_t busy_bits;
	uint32_t *register_base;
	int probed;
};

struct mpc56xx_mem_layout {
	uint32_t block_start;
	uint32_t block_size;
	uint32_t lmlr_bit;
	uint32_t hlr_bit;
};

static const struct mpc56xx_mem_layout mem_layout_array0[] = {
	{0x00000000, 0x04000, 0x01, 0x00},
	{0x00004000, 0x04000, 0x02, 0x00},
	{0x00008000, 0x08000, 0x04, 0x00},
	{0x00010000, 0x08000, 0x08, 0x00},
	{0x00018000, 0x04000, 0x10, 0x00},
	{0x0001c000, 0x04000, 0x20, 0x00},
	{0x00020000, 0x10000, 0x40, 0x00},
	{0x00030000, 0x10000, 0x80, 0x00},
	{0x00040000, 0x20000, 0x10000, 0x00}, /* NA in 768K deriv */
	{0x00060000, 0x20000, 0x20000, 0x00}  /* NA in 768K deriv */
};
static const struct mpc56xx_mem_layout mem_layout_array1[] = {
	{0x00080000, 0x20000, 0x00, 0x01},
	{0x000a0000, 0x20000, 0x00, 0x02},
	{0x000c0000, 0x20000, 0x00, 0x04},
	{0x000e0000, 0x20000, 0x00, 0x08}
};
static const struct mpc56xx_mem_layout mem_layout_array2[] = {
		{0x00100000, 0x20000, 0x00, 0x01}, /* NA in 768K or 1M deriv */
		{0x00120000, 0x20000, 0x00, 0x02}, /* NA in 768K or 1M deriv */
		{0x00140000, 0x20000, 0x00, 0x04}, /* NA in 768K or 1M deriv */
		{0x00160000, 0x20000, 0x00, 0x08}  /* NA in 768K or 1M deriv */
};

static const uint32_t mpc56xx_flash_regs[3] = {
		0xc3f88000,
		0xc3fb0000,
		0xc3fb4000
};

#define MPC56XX_BIUCR	0xc3f8801C
#define MPC56XX_BIUAPR	0xc3f88020
#define MPC56XX_BIUCR2	0xc3f88024
#define MPC56XX_PFCR3	0xc3f88028

#define MPC56XX_MCR_OFFSET		0x00
#define MPC56XX_LMLR_OFFSET		0x04
#define MPC56XX_HLR_OFFSET		0x08
#define MPC56XX_SLMLR_OFFSET	0x0c
#define MPC56XX_LMSR_OFFSET		0x10
#define MPC56XX_HSR_OFFSET		0x14
#define MPC56XX_AR_OFFSET		0x18

#define MPC56XX_LMLR_LME_PASS	0xA1A11111
#define MPC56XX_HLR_HBE_PASS	0xB2B22222
#define MPC56XX_SLMLR_SLE_PASS	0xC3C33333
/*
 * DEVID values
 */

static const struct mpc56xx_devs_s {
	uint32_t devid;
	const char *name;
} mpc56xx_devs[] = {
	{0x07c2201d, "MPC5634M JTAG"}, /* Developed against this chip only. */
	{0x00000000, NULL}
};

#if 0
static int mpc56x_get_flash_adr(struct flash_bank *bank, uint32_t reg)
{
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;
	return mpc56xx_info->register_base | reg;
}
#endif

static int mpc56xx_build_block_list(struct flash_bank *bank)
{
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;

	int i;
	int num_blocks;
	int b[3];
	b[0] = 0;
	b[1] = 0;
	b[2] = 0;

	switch (bank->size) {
		case 0x180000: /* 1.5M */
			b[0] = 10;
			b[1] = 4;
			b[2] = 4;
			break;
		case 0x100000: /* 1 M */
			b[0] = 10;
			b[1] = 4;
			b[2] = 0;
			break;
		case 0x0c0000: /* 768M */
			b[0] = 8;
			b[1] = 4;
			b[2] = 0;
			break;
		default:
			LOG_ERROR("BUG: unknown bank->size encountered. Only 0x180000, 0x100000, 0xc0000 supported.");
			exit(-1);
	}

	num_blocks = b[0] + b[1] + b[2];

	printf("b0=%d, b1=%d, b2=%d\n", b[0], b[1], b[2]);

	bank->num_sectors = num_blocks;
	bank->sectors = malloc(sizeof(struct flash_sector) * num_blocks);
	mpc56xx_info->block_bits_lmlr = malloc(sizeof(uint32_t) * num_blocks);
	mpc56xx_info->block_bits_hlr = malloc(sizeof(uint32_t) * num_blocks);
	mpc56xx_info->register_base = malloc(sizeof(uint32_t) * num_blocks);

	num_blocks = 0;

	for (i = 0; i < b[0]; i++) {
		bank->sectors[num_blocks].offset = mem_layout_array0[i].block_start;
		bank->sectors[num_blocks].size = mem_layout_array0[i].block_size;
		bank->sectors[num_blocks].is_erased = -1;
		bank->sectors[num_blocks].is_protected = 1; /* protection bits likely set by hardware */
		mpc56xx_info->block_bits_lmlr[num_blocks] = mem_layout_array0[i].lmlr_bit;
		mpc56xx_info->block_bits_hlr[num_blocks] = mem_layout_array0[i].hlr_bit;
		mpc56xx_info->register_base[num_blocks++] = mpc56xx_flash_regs[0]; /* base register address per block */
	}

	for (i = 0; i < b[1]; i++) {
		bank->sectors[num_blocks].offset = mem_layout_array1[i].block_start;
		bank->sectors[num_blocks].size = mem_layout_array1[i].block_size;
		bank->sectors[num_blocks].is_erased = -1;
		bank->sectors[num_blocks].is_protected = 1; /* protection bits likely set by hardware */
		mpc56xx_info->block_bits_lmlr[num_blocks] = mem_layout_array1[i].lmlr_bit;
		mpc56xx_info->block_bits_hlr[num_blocks] = mem_layout_array1[i].hlr_bit;
		mpc56xx_info->register_base[num_blocks++] = mpc56xx_flash_regs[1]; /* base register address per block */
	}

