openocd-org/openocd/src/flash/nor/mpc56xx.c
	for (i = 0; i < b[2]; i++) {
		bank->sectors[num_blocks].offset = mem_layout_array2[i].block_start;
		bank->sectors[num_blocks].size = mem_layout_array2[i].block_size;
		bank->sectors[num_blocks].is_erased = -1;
		bank->sectors[num_blocks].is_protected = 1; /* protection bits likely set by hardware */
		mpc56xx_info->block_bits_lmlr[num_blocks] = mem_layout_array2[i].lmlr_bit;
		mpc56xx_info->block_bits_hlr[num_blocks] = mem_layout_array2[i].hlr_bit;
		mpc56xx_info->register_base[num_blocks++] = mpc56xx_flash_regs[2]; /* base register address per block */
	}

	return ERROR_OK;
}

/* flash bank mpc56xx 0 0 0 0 <target#>
 */
FLASH_BANK_COMMAND_HANDLER(mpc56xx_flash_bank_command)
{
	struct mpc56xx_flash_bank *mpc56xx_info;

	if (CMD_ARGC < 6)
		return ERROR_COMMAND_SYNTAX_ERROR;

	mpc56xx_info = malloc(sizeof(struct mpc56xx_flash_bank));
	bank->driver_priv = mpc56xx_info;

	mpc56xx_info->probed = 1; /* ensure probe does not occur */

	/*printf("ARGV[6] = %s\n", CMD_ARGV[6]);*/
	/* varies per bank - FIXME */
	/*mpc56xx_info->register_base = 0xc3f80000;*/
	/* set up other bits perhaps */
	mpc56xx_build_block_list(bank);

	return ERROR_OK;
}

static int mpc56xx_protect_check(struct flash_bank *bank)
{
	struct target *target = bank->target;
	/*struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;*/

	/*uint32_t config0_address;
	uint32_t devcfg0;*/
	int s;
	int num_pages;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

#if 0
	config0_address = MPC56XX_DEVCFG0;

	target_read_u32(target, config0_address, &devcfg0);

	if ((devcfg0 & (1 << 28)) == 0) /* code protect bit */
		num_pages = 0xffff;			/* All pages protected */
	else if (Virt2Phys(bank->base) == MPC56XX_PHYS_BOOT_FLASH) {
		if (devcfg0 & (1 << 24))
			num_pages = 0;			/* All pages unprotected */
		else
			num_pages = 0xffff;		/* All pages protected */
	} else {
		/* pgm flash */
		num_pages = (~devcfg0 >> 12) & 0xff;
	}
#endif
	num_pages = 0xffff; /* FIXME */

	for (s = 0; s < bank->num_sectors && s < num_pages; s++)
		bank->sectors[s].is_protected = 1;
	for (; s < bank->num_sectors; s++)
		bank->sectors[s].is_protected = 0;

	return ERROR_OK;
}

static int mpc56xx_unlock_block(struct flash_bank *bank, uint32_t block_num)
{
	struct target *target = bank->target;
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;
	int retval;
	uint32_t val;
	uint32_t reg_base;

	reg_base = mpc56xx_info->register_base[block_num];

	/* See if this flash block uses HLR and unlock */
	if (mpc56xx_info->block_bits_hlr[block_num]) {
		retval = target_read_memory(target, reg_base + MPC56XX_HLR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Original HLR= 0x%08x\n", val);
		if ((val & 0x80000000) == 0) {
			/* unlock password */
			retval = target_write_u32(target, reg_base + MPC56XX_HLR_OFFSET, MPC56XX_HLR_HBE_PASS);
			if (retval != ERROR_OK)
				return retval;
			retval = target_read_memory(target, reg_base + MPC56XX_HLR_OFFSET, 4, 1,
					(uint8_t *)&val);
			val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
			printf("Now HLR= 0x%08x\n", val);
		}
		val &= ~mpc56xx_info->block_bits_hlr[block_num]; /* Set appropriate bits to zero to unlock */
		retval = target_write_u32(target, reg_base + MPC56XX_HLR_OFFSET, val);
		if (retval != ERROR_OK)
			return retval;

		retval = target_read_memory(target, reg_base + MPC56XX_HLR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Now HLR= 0x%08x\n", val);
	}

	/* See if this flash block uses LMLR and unlock */
	if (mpc56xx_info->block_bits_lmlr[block_num]) {
		retval = target_read_memory(target, reg_base + MPC56XX_LMLR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Original LMLR= 0x%08x\n", val);
		if ((val & 0x80000000) == 0) {
			/* unlock password */
			retval = target_write_u32(target, reg_base + MPC56XX_LMLR_OFFSET, MPC56XX_LMLR_LME_PASS);
			if (retval != ERROR_OK)
				return retval;
			retval = target_read_memory(target, reg_base + MPC56XX_LMLR_OFFSET, 4, 1,
					(uint8_t *)&val);
			val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
			printf("Now LMLR= 0x%08x\n", val);
		}
		val &= ~mpc56xx_info->block_bits_lmlr[block_num]; /* Set appropriate bits to zero to unlock */
		retval = target_write_u32(target, reg_base + MPC56XX_LMLR_OFFSET, val);
		if (retval != ERROR_OK)
			return retval;

		retval = target_read_memory(target, reg_base + MPC56XX_LMLR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Now LMLR= 0x%08x\n", val);

		/* Now do same again for secondary reg */

		retval = target_read_memory(target, reg_base + MPC56XX_SLMLR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Original SLMLR= 0x%08x\n", val);
		if ((val & 0x80000000) == 0) {
			/* unlock password */
			retval = target_write_u32(target, reg_base + MPC56XX_SLMLR_OFFSET, MPC56XX_SLMLR_SLE_PASS);
			if (retval != ERROR_OK)
				return retval;
			retval = target_read_memory(target, reg_base + MPC56XX_SLMLR_OFFSET, 4, 1,
					(uint8_t *)&val);
			val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
			printf("Now SLMLR= 0x%08x\n", val);
		}
		val &= ~mpc56xx_info->block_bits_lmlr[block_num]; /* Set appropriate bits to zero to unlock */
		retval = target_write_u32(target, reg_base + MPC56XX_SLMLR_OFFSET, val);
		if (retval != ERROR_OK)
			return retval;

		retval = target_read_memory(target, reg_base + MPC56XX_SLMLR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Now SLMLR= 0x%08x\n", val);
	}

	return ERROR_OK;
}

static int mpc56xx_flash_set_sr(struct flash_bank *bank, uint32_t block_num)
{
	struct target *target = bank->target;
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;
	int retval;
	uint32_t val;
	uint32_t reg_base;

