openocd-org/openocd/src/flash/nor/mpc56xx.c
	reg_base = mpc56xx_info->register_base[block_num];

	/* See if this flash block uses HLR / HSR */
	if (mpc56xx_info->block_bits_hlr[block_num]) {
		retval = target_read_memory(target, reg_base + MPC56XX_HSR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Original HSR= 0x%08x\n", val);
		val |= mpc56xx_info->block_bits_hlr[block_num]; /* Set appropriate bits to one */
		retval = target_write_u32(target, reg_base + MPC56XX_HSR_OFFSET, val);
		if (retval != ERROR_OK)
			return retval;

		retval = target_read_memory(target, reg_base + MPC56XX_HSR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Now HLR= 0x%08x\n", val);
	}

	/* See if this flash block uses LMLR / LMSR */
	if (mpc56xx_info->block_bits_lmlr[block_num]) {
		retval = target_read_memory(target, reg_base + MPC56XX_LMSR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Original LMSR= 0x%08x\n", val);
		val |= mpc56xx_info->block_bits_lmlr[block_num]; /* Set appropriate bits to one */
		retval = target_write_u32(target, reg_base + MPC56XX_LMSR_OFFSET, val);
		if (retval != ERROR_OK)
			return retval;

		retval = target_read_memory(target, reg_base + MPC56XX_LMSR_OFFSET, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		printf("Now LMSR= 0x%08x\n", val);
	}

	return ERROR_OK;
}

static int mpc56xx_erase(struct flash_bank *bank, int first, int last)
{
	struct target *target = bank->target;
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;
	int retval, retry;
	uint32_t val;
	uint32_t reg_base;
	int block_num;

	printf("Got a call to erase!\n");

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	for (block_num = first; block_num <= last; block_num++) {

		reg_base = mpc56xx_info->register_base[block_num];

		retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000000); /* Clear MCR */
		if (retval != ERROR_OK)
			return retval;

		retval = mpc56xx_unlock_block(bank, block_num);
		if (retval != ERROR_OK)
			return retval;

		retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000004); /* select ERS operation */
		if (retval != ERROR_OK)
			return retval;

		retval = mpc56xx_flash_set_sr(bank, block_num); /* Set LMSR or HSR */
		if (retval != ERROR_OK)
			return retval;

		/* write something to the first address in that flash bank */
		retval = target_write_u32(target, bank->sectors[block_num].offset, 0xffffffff);
		if (retval != ERROR_OK)
			return retval;

		retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000005); /* select ERS+EHV operation */
		if (retval != ERROR_OK)
			return retval;

		/* Wait for Done=1 */
		retry = 100; /* arbitrary limit */
		val = 0;
		while (retry && ((val & 0x00000400) == 0)) {
			retval = target_read_memory(target, reg_base + MPC56XX_MCR_OFFSET, 4, 1,
					(uint8_t *)&val);
			val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
			if (retval != ERROR_OK)
				return retval;
			retry--;
		}

		retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000004); /* clear EHV */
		if (retval != ERROR_OK)
			return retval;

		retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000000); /* clear ERS */
		if (retval != ERROR_OK)
			return retval;

		if ((val & 0x00000200) == 0) {
			LOG_ERROR("Received error on flash erase");
			return ERROR_FAIL;
		}
	}

	return ERROR_OK;
}

static int mpc56xx_protect(struct flash_bank *bank, int set, int first, int last)
{
	struct target *target = bank->target;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	return ERROR_OK;
}

/* Determines sector details give a flash address */
static int mpc56xx_get_sect(struct flash_bank *bank, uint32_t address, uint32_t *start, uint32_t *end)
{
	int i, block_num;
	uint32_t sec_start, sec_end;

	sec_start = 0;
	sec_end = 0;

	/* Validate address */
	block_num = -1;
	for (i = 0; i < bank->num_sectors; i++) {
		sec_start = bank->sectors[i].offset;
		sec_end = sec_start + bank->sectors[i].size;

		/* check if destination falls within the current sector */
		if ((address >= sec_start) && (address < sec_end)) {
			block_num = i;
			break;
		}
	}

	*start = sec_start;
	*end = sec_end - 1;

	return block_num;
}

static int mpc56xx_write(struct flash_bank *bank, const uint8_t *buffer, uint32_t offset, uint32_t count)
{
	struct target *target = bank->target;
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;
	uint32_t words_remaining = (count / 4);
	uint32_t bytes_written = 0;
	uint32_t bytes_remaining = (count & 0x00000007);
	uint32_t address = bank->base + offset;
	int retval, retry;
	uint32_t val;
	uint32_t reg_base, cur_sec_start, cur_sec_end;
	int block_num, tail_end = 0;

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	LOG_DEBUG("writing to flash at address 0x%08" PRIx32 " at offset 0x%8.8" PRIx32
			" count: 0x%8.8" PRIx32 "", bank->base, offset, count);

	if (offset & 0x7) {
		LOG_WARNING("offset 0x%" PRIx32 "breaks required 8-byte alignment", offset);
		return ERROR_FLASH_DST_BREAKS_ALIGNMENT;
		/* Could workaround this, but not presently. */
	}

	printf("Entered write_block code!\n");

	block_num = -1;
	cur_sec_start = 1; /* intentionally invalid */
	cur_sec_end = 0;
	reg_base = 0;

	while (words_remaining) {
		uint32_t value, value2;

		if ((address < cur_sec_start) || (address > cur_sec_end)) {
			printf("Address = 0x%08x\n", address);
			if (block_num >= 0) {
				/* Ensure MCR for existing sector is cleared */
				/* reg_base will have been set */
				retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000000);
				if (retval != ERROR_OK)
					return retval;
			}
			block_num = mpc56xx_get_sect(bank, address, &cur_sec_start, &cur_sec_end);

