openocd-org/openocd/src/flash/nor/mpc56xx.c
			if (block_num < 0)
				return ERROR_FLASH_DST_OUT_OF_BANK;

			reg_base = mpc56xx_info->register_base[block_num];

			retval = mpc56xx_unlock_block(bank, block_num);
			if (retval != ERROR_OK)
				return retval;

			/* Ensure MCR for new sector is cleared */
			retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000000);
			if (retval != ERROR_OK)
				return retval;

			retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000010); /* Select PGM */
			if (retval != ERROR_OK)
				return retval;
		}

		if (tail_end) {
			uint8_t byte_buf[8];
			LOG_INFO("Tail end data flash, not sure this is correct. Please check.");
			printf("Handling the stragglers %d\n", bytes_remaining);
			memset(byte_buf, 0, 8);
			memcpy(byte_buf, buffer + bytes_written, sizeof(uint32_t));
			value = be_to_h_u32((uint8_t *)&byte_buf[0]); /* read from buffer BE */
			value2 = be_to_h_u32((uint8_t *)&byte_buf[4]);
			words_remaining = 2;
			bytes_remaining = 0;
		} else {
			memcpy(&value, buffer + bytes_written, sizeof(uint32_t));
			memcpy(&value2, buffer + bytes_written + 4, sizeof(uint32_t));
			value = be_to_h_u32((uint8_t *)&value); /* swap ends again */
			value2 = be_to_h_u32((uint8_t *)&value2); /* swap ends again */
		}

		/* Skip writes if the data is the same as erased flash value */
		if ((value != 0xffffffff) && (value2 != 0xffffffff)) {
			retval = target_write_u32(target, address, value); /* Write first 32bits */
			if (retval != ERROR_OK)
				return retval;

			retval = target_write_u32(target, address + 4, value2); /* Write second 32bits */
			if (retval != ERROR_OK)
				return retval;

			retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000011); /* Set EHV */
			if (retval != ERROR_OK)
				return retval;

			/* Wait for Done=1 */
			retry = 100; /* arbitrary limit */
			val = 0;
			while (retry && ((val & 0x00000400) == 0)) {
				retval = target_read_memory(target, reg_base + MPC56XX_MCR_OFFSET, 4, 1,
						(uint8_t *)&val);
				val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
				if (retval != ERROR_OK)
					return retval;
				retry--;
			}

			/* Clear EHV for each 64bit programmed */
			retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000010);
			if (retval != ERROR_OK)
				return retval;

			if ((val & 0x00000200) == 0) {
				LOG_ERROR("Received error on flash erase");
				return ERROR_FAIL;
			}
		}
		if ((words_remaining <= 2) && (bytes_remaining))
			tail_end = 1;
		bytes_written += 8;
		words_remaining -= 2;
		address += 8;
	}

	if (block_num >= 0) {
		/* Ensure MCR for existing sector is cleared */
		/* reg_base will have been set */
		retval = target_write_u32(target, reg_base + MPC56XX_MCR_OFFSET, 0x00000000);
		if (retval != ERROR_OK)
			return retval;
	}

	return ERROR_OK;
}

static int mpc56xx_probe(struct flash_bank *bank)
{
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;

	if (mpc56xx_info->probed == 0) {
		printf("Probe bypassed.\n");
		LOG_DEBUG("Probe bypassed");
	}

	return ERROR_OK;
}

static int mpc56xx_auto_probe(struct flash_bank *bank)
{
	struct mpc56xx_flash_bank *mpc56xx_info = bank->driver_priv;
	if (mpc56xx_info->probed)
		return ERROR_OK;
	return mpc56xx_probe(bank);
}

static int mpc56xx_info(struct flash_bank *bank, char *buf, int buf_size)
{
	/*struct target *target = bank->target;
	struct mpc5634_common *mpc5634 = target->arch_info;
	struct mpc5634_jtag *jtag_info = &mpc5634->jtag;*/
	uint32_t device_id;
	int printed = 0, i;

	/*device_id = jtag_info->idcode;*/
	device_id = 0x87654321;

	if (((device_id >> 1) & 0x7ff) != MPC56XX_MANUF_ID) {
		snprintf(buf, buf_size,
				 "Cannot identify target as a MPC56XX family (manufacturer 0x%03d != 0x%03d)\n",
				 (unsigned)((device_id >> 1) & 0x7ff),
				 MPC56XX_MANUF_ID);
		return ERROR_FLASH_OPERATION_FAILED;
	}

	for (i = 0; mpc56xx_devs[i].name != NULL; i++) {
		if (mpc56xx_devs[i].devid == (device_id & 0x0fffffff)) {
			printed = snprintf(buf, buf_size, "MPC56XX%s", mpc56xx_devs[i].name);
			break;
		}
	}

	if (mpc56xx_devs[i].name == NULL)
		printed = snprintf(buf, buf_size, "Unknown");

	buf += printed;
	buf_size -= printed;
	snprintf(buf, buf_size, " Ver: 0x%02x",
			(unsigned)((device_id >> 28) & 0xf));

	return ERROR_OK;
}

#if 0
COMMAND_HANDLER(mpc56xx_handle_pgm_word_command)
{
	uint32_t address, value;
	int status, res;

	if (CMD_ARGC != 3)
		return ERROR_COMMAND_SYNTAX_ERROR;

	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[0], address);
	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[1], value);

	struct flash_bank *bank;
	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 2, &bank);
	if (ERROR_OK != retval)
		return retval;

	if (address < bank->base || address >= (bank->base + bank->size)) {
		command_print(CMD_CTX, "flash address '%s' is out of bounds", CMD_ARGV[0]);
		return ERROR_OK;
	}

	res = ERROR_OK;
	status = mpc56xx_write_word(bank, address, value);
	if (status & NVMCON_NVMERR)
		res = ERROR_FLASH_OPERATION_FAILED;
	if (status & NVMCON_LVDERR)
		res = ERROR_FLASH_OPERATION_FAILED;

	if (res == ERROR_OK)
		command_print(CMD_CTX, "mpc56xx pgm word complete");
	else
		command_print(CMD_CTX, "mpc56xx pgm word failed (status = 0x%x)", status);

	return ERROR_OK;
}
#endif

COMMAND_HANDLER(mpc56xx_handle_unlock_command)
{
	/*uint32_t mchip_cmd;
	struct target *target = NULL;
	struct mips_m4k_common *mips_m4k;
	struct mips_ejtag *ejtag_info;
	int timeout = 10;*/

	if (CMD_ARGC < 1) {
		command_print(CMD_CTX, "mpc56xx unlock <bank>");
		return ERROR_COMMAND_SYNTAX_ERROR;
	}

	struct flash_bank *bank;
	int retval = CALL_COMMAND_HANDLER(flash_command_get_bank, 0, &bank);
	if (ERROR_OK != retval)
		return retval;
printf("Not handled!\n");
return ERROR_FAIL;
#if 0
	not handled yet
	target = bank->target;
	mpc5634 = target_to_mpc5634(target);
	jtag_info = &mpc5634->mpc5634.jtag_info;

	/* we have to use the MTAP to perform a full erase */
	mips_ejtag_set_instr(ejtag_info, MTAP_SW_MTAP);
	mips_ejtag_set_instr(ejtag_info, MTAP_COMMAND);

