openocd-org/openocd/src/flash/nor/mpc56xx.c
	/* first check status of device */
	mchip_cmd = MCHP_STATUS;
	mips_ejtag_drscan_8(ejtag_info, &mchip_cmd);
	if (mchip_cmd & (1 << 7)) {
		/* device is not locked */
		command_print(CMD_CTX, "mpc56xx is already unlocked, erasing anyway");
	}

	/* unlock/erase device */
	mips_ejtag_drscan_8_out(ejtag_info, MCHP_ASERT_RST);
	jtag_add_sleep(200);

	mips_ejtag_drscan_8_out(ejtag_info, MCHP_ERASE);

	do {
		mchip_cmd = MCHP_STATUS;
		mips_ejtag_drscan_8(ejtag_info, &mchip_cmd);
		if (timeout-- == 0) {
			LOG_DEBUG("timeout waiting for unlock: 0x%" PRIx32 "", mchip_cmd);
			break;
		}
		alive_sleep(1);
	} while ((mchip_cmd & (1 << 2)) || (!(mchip_cmd & (1 << 3))));

	mips_ejtag_drscan_8_out(ejtag_info, MCHP_DE_ASSERT_RST);

	/* select ejtag tap */
	mips_ejtag_set_instr(ejtag_info, MTAP_SW_ETAP);

	command_print(CMD_CTX, "mpc56xx unlocked.\n"
			"INFO: a reset or power cycle is required "
			"for the new settings to take effect.");

	return ERROR_OK;
#endif
}

static const struct command_registration mpc56xx_exec_command_handlers[] = {
/*	{
		.name = "pgm_word",
		.usage = "<addr> <value> <bank>",
		.handler = mpc56xx_handle_pgm_word_command,
		.mode = COMMAND_EXEC,
		.help = "program a word",
	},*/
	{
		.name = "unlock",
		.handler = mpc56xx_handle_unlock_command,
		.mode = COMMAND_EXEC,
		.usage = "[bank_id]",
		.help = "Unlock/Erase entire device.",
	},
	COMMAND_REGISTRATION_DONE
};

static const struct command_registration mpc56xx_command_handlers[] = {
	{
		.name = "mpc56xx",
		.mode = COMMAND_ANY,
		.help = "mpc56xx flash command group",
		.usage = "",
		.chain = mpc56xx_exec_command_handlers,
	},
	COMMAND_REGISTRATION_DONE
};

struct flash_driver mpc56xx_flash = {
	.name = "mpc56xx",
	.commands = mpc56xx_command_handlers,
	.flash_bank_command = mpc56xx_flash_bank_command,
	.erase = mpc56xx_erase,
	.protect = mpc56xx_protect,
	.write = mpc56xx_write,
	.read = default_flash_read,
	.probe = mpc56xx_probe,
	.auto_probe = mpc56xx_auto_probe,
	.erase_check = default_flash_blank_check,
	.protect_check = mpc56xx_protect_check,
	.info = mpc56xx_info,
};
